[
  {
    "id": 1,
    "name": "basketball-stars-2019",
    "link": "https://games.crazygames.com/en_US/basketball-stars-2019/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/games/basketball-stars-2019/cover-1583231506155.png?metadata=none&quality=85&width=273&fit=crop",
    "href": "https://www.crazygames.com/game/basketball-stars-2019",
    "detail": "Games»Sports»Basketball»Basketball Stars\nBasketball Stars\nShare\nDeveloper\nMadPuffers\nRating\n8.4\n(103,193 votes)\nReleased\nMay 2019\nLast Updated\nApril 2025\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\n2 Player\n\n208\n\nBasketball\n\n34\n\nBasketball Stars is a 2-player basketball game by Madpuffers where you hit the court as legends like LeBron James, Stephen Curry, and James Harden. Play solo, team up with a friend or challenge them in fast-paced hoops action!\n\nBasketball Stars is the prequel to the popular game Basketball Legends, another fun sports game you can play for free at CrazyGames on your desktop or mobile device.\n\nHow to Play Basketball Pros\nPlay solo or with a friend\n\nTeam up with your friends cooperatively or play solo in 1v2 and 2v2 quick-match basketball games. You can also play head-to-head. If you’re playing seriously, join tournament mode and scrap your way through the heats to become the ultimate b-ball legend.\n\nShoot hoops like a pro\n\nBasketball Stars stays true to the sport with alley-oops, and epic slam dunks that score you impressive points. Dash around and do epic jump shots to keep your opponent on their toes.\n\nEach player in Basketball Stars has a unique ability, such as a mega dunk, defense, or fast break, so pick a pair that will bring home the trophy for you.\n\nBasketball Stars Tips\n\nThere are no 3-pointers in Basketball Stars, so you can refrain from taking long-distance shots, unless there is a very good reason to do so during the game.\n\nWatch out for the SuperShot, which gets charged in the top-left of your screen: once it's fully loaded, it can be activated by pressing Z, and your player will execute a spectacular slam dunk, regardless of his position on the pitch.\n\nMore Games Like This\n\nDid you enjoy shooting hoops? Try out more of our excellent free basketball games or browse our sports category for baseball, soccer, golf, boxing, and more. Another popular game in this section is Basket Random, a simple one-button game with interesting physics; BasketBros, a fast-paced match; or Basketball Legends 2020, another basketball game by MadPuffers.\n\nShoot different types of balls with Bubble Shooter and sprint on a different kind of turf in Geometry Dash.\n\nFeatures\nPlay 2-player basketball games solo or with friends\nSelect a game mode - tournament or quick match\nPlay as the attacker or as the defender\nVarious famous teams to choose from\nRelease Date\n\nMay 2019\n\nDeveloper\n\nThis game is made by MadPuffers.\n\nPlatform\n\nWeb browser (desktop and mobile)\n\nLast Updated\n\nApr 21, 2025\n\nControls\n1 player controls\nWASD or arrow keys to move\nX/L to shoot/steal\nS to pump/block\nA+A or D+D or left/right arrow twice to dash\nK/Z to super shot\n2 player controls\nTo move, player 1 use the WASD keys and player 2 use arrow keys\nTo shoot/steal, player 1 use B and player 2 use L\nTo pump, player 1 use S and player 2 use down arrow\nTo dash, player 1 use A/D twice and player 2 use left/right arrow twice\nK to super shot\nFAQ\nCan I play Basketball Stars on my phone and tablet?\nYes, you can play Basketball Stars on any device, including phones, tablets, and computers! This includes Android devices as well as Apple devices such as the iPhone and iPad.\nWho created Basketball Stars?\n\nMadpuffers developed Basketball Stars. They also created other popular browser games like Moto X3M and Basketball Legends.\n\nWhere can I play Basketball Stars?\n\nYou can play Basketball Stars at CrazyGames.\n\nGameplay Video\nMore Games In This Series\nBasketball Legends 2020"
  },
  {
    "id": 2,
    "name": "basket-random",
    "link": "https://games.crazygames.com/en_US/basket-random/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basket-random_16x9/20240617090207/basket-random_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "href": "https://www.crazygames.com/game/basket-random",
    "detail": "Games»Sports»Basketball»Basket Random\nBasket Random\nShare\nDeveloper\nRHM Interactive\nRating\n8.7\n(68,895 votes)\nReleased\nJune 2020\nLast Updated\nJuly 2024\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(Android)\n\nSports\n\n151\n\n2 Player\n\n208\n\nPhysics\n\n349\n\nBasketball\n\n34\n\nRagdoll\n\n53\n\nBasket Random is a chaotic 2-player arcade sports game with unpredictable physics. Bounce and battle for the ball across wild courts, with each dunk launching you to the next level!\n\nHow to Play Basket Random\n\nBasket Random shares similar features with other games in the \"Random\" series: your characters defy the laws of physics and may react unexpectedly to your input. You can challenge the CPU or play with a friend.\n\nThis two-player basketball game shares the same concept as a typical basketball game: shoot the ball into the net, but with a few unusual and humorous twists. You can challenge the CPU or play with a friend.\n\nThere are two teams, each consisting of two players. Controls guide both your players, but be warned that their actions may not coincide with exactly how you expected them to move. Slam dunks are still very possible!\n\nUse the W key to control player one and the up arrow to control player two. Fight frantically over the basketball, bouncing and spinning in the air, trying to make the shot. Whatever team scores first wins that round. The first team to reach 5 wins the game!\n\nAfter each basket, you’re transported to a new place where the court and the surroundings have changed, and physics and attire may differ, shaking up each new round with random changes! In some cases, players will have longer arms, in others, the ball might be heavier, or baskets might be worth double points! Bobble around, shooting hoops and having fun in this wacky take on basketball.\n\nFeatures\nStrange bouncy basketball players\nLevels and physics change randomly\nPlay the game with a friend\nFun basketball game with a twist\nMore Games Like This\n\nCheck out Soccer Random for a soccer game with the same mechanics. Other popular basketball games in our sports category include BasketBros, a fast-paced, arcade-style action game.\n\nOther unrelated fan favorites are Sprunki and Geometry Dash, two casual games with an interesting musical twist.\n\nRelease Date\nApril 2020 (HTML5)\nApril 2020 (Android)\nDeveloper\n\nRHM Interactive made Basket Random.\n\nPlatforms\nWeb browser (desktop and mobile)\nAndroid\niOS\nLast Updated\n\nJul 04, 2024\n\nControls\n\nPress W or up arrow key.\n\nFAQ\nWhat devices can I play Basket Random on?\n\nYou can play this game on the web on most desktop and mobile devices.\n\nAre there any other games like Basket Random?\n\nYes, you can also find the same wacky physics in Soccer Random.\n\nGameplay Video\nMore Games In This Series\nSoccer Random\nVolley Random\nBoxing Random"
  },
  {
    "id": 3,
    "name": "unmatched-basketball",
    "href": "https://www.crazygames.com/game/unmatched-basketball",
    "link": "https://games.crazygames.com/en_US/unmatched-basketball/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/unmatched-basketball_16x9/20251028035413/unmatched-basketball_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Unmatched Basketball\nUnmatched Basketball\nShare\nDeveloper\n1Car2Wills Games\nRating\n9.4\n(6,326 votes)\nReleased\nOctober 2025\nLast Updated\nOctober 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop-only), App Store(iOS, Android)\n\nSports\n\n151\n\n3D\n\n1,250\n\nWith Friends\n\n103\n\nBall\n\n165\n\nBasketball\n\n34\n\nMultiplayer\n\n351\nAdvertisement\n\nUnmatched Basketball is a thrilling 3v3 third-person basketball experience where quick reflexes and flashy moves decide the game. You’ll dribble past defenders, block shots, and pull off outrageous trick plays while customizing your own basketball legend with unique styles and abilities. Every match demands sharp precision, bold creativity, and teamwork as you rise to prove your dominance on the court.\n\nLast Updated\n\nOct 28, 2025\n\nControls\nWASD = movement\nMouse = look around\n\nWith ball\n\nLeft Click = shoot\nRight Click = dribble\nF = pass\n\nWithout ball\n\nShift = enter or leave tackle stance\nSpace = dash\nE = right dribble\nQ = left dribble\nX + Right Click = down dribble (only available with some styles)"
  },
  {
    "id": 4,
    "name": "basketball-orbit",
    "href": "https://www.crazygames.com/game/basketball-orbit",
    "link": "https://games.crazygames.com/en_US/basketball-orbit/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketball-orbit_16x9/20250505030520/basketball-orbit_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Orbit\nBasketball Orbit\nShare\nRating\n9.1\n(64,215 votes)\nReleased\nApril 2025\nLast Updated\nMay 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nSports\n\n151\n\nMobile\n\n974\n\nPhysics\n\n351\n\nBall\n\n165\n\nBasketball\n\n34\n\n2D\n\n975\n\nSkill\n\n247\n\nMouse\n\n1,644\nAdvertisement\n\nBasketball Orbit is an exhilarating sports basketball simulation game in our sports category, where you aim to launch basketballs to unbelievable heights, even beyond Earth’s atmosphere! Take on thrilling one-shot basketball challenges, conquer tricky levels, and perfect your shooting technique. Compete to become the ultimate basketball legend in this fun and unique basketball adventure!\n\nHow to Play Basketball Orbit\n\nYour goal in Basketball Orbit is to sink a basketball into the hoop from over 100 feet away. Don’t worry, you don’t have to make the shot in one go.\n\nYour score is based on strength, speed, and bounce, and those attributes determine your rewards.\n\nThis one-click game demands both patience and precision. Watch the color meter in the center of your screen as it flashes red, yellow, orange, and green. Click when the meter hits green for the best shot. A green click sends your ball soaring. Yellow gets you partway, and red? That just keeps the ball bouncing at your feet.\n\nKeep clicking to move forward. Once you're within a few feet of the hoop, you can fine-tune your shot: click and move your mouse to aim directly into the basket.\n\nHead to the locker room to change your character or the game’s background. Some options require upgrades.\n\nWant to boost your skills? Watch ads to earn extra points, then invest those points into strength, speed, or bounce. Max out your stats and aim for the ultimate slam dunk!\n\nMore Games Like This\n\nStay in the game and explore some of our most exciting sports titles, including popular basketball games like Basketbros brings quick-fire basketball action with customization and multiplayer fun. or Basket Random, a fun 2-player game layered with unpredictable physics. Basketball Legends is a two-player basketball game where you play against the legends - in bobblehead form!\n\nLast Updated\n\nMay 05, 2025\n\nControls\n\nUse the left mouse button or space to shoot the ball.\n\nFAQ\nWhat is the circle in basketball called?\n\nThe circle on the court in basketball is called the center circle.\n\nHow can I slam dunk the ball in Basketball Orbit?\n\nIf you want to get the ball in one shot, you need to carefully hit your colored target. It is more likely you can get your ball straight in the hoop when it is only within sight. All you have to do is position the arc to hit the hoop, and you're sure to get a slam dunk.\n\nGameplay Video\nMore Games In This Series\nGolf Orbit\nFish Orbit"
  },
  {
    "id": 5,
    "name": "basketbros",
    "href": "https://www.crazygames.com/game/basketbros",
    "link": "https://games.crazygames.com/en_US/basketbros/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketbros_16x9/20251107022434/basketbros_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»BasketBros\nBasketBros\nShare\nDeveloper\nBlue Wizard Digital\nRating\n9.0\n(19,303 votes)\nReleased\nJanuary 2020\nLast Updated\nMarch 2025\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nPixel\n\n322\n\n2 Player\n\n207\n\n1 Player\n\n149\n\nArena\n\n237\n\nBall\n\n165\n\nBasketball\n\n34\n\n2D\n\n975\n\nMultiplayer\n\n351\n\nBasketBros is a fast-paced basketball game that offers both online and offline gameplay. Choose a player, customize your style, and compete in single-player and multiplayer games.\n\nThrow down some sick dunks and win the game to earn upgrades and unlockables.\n\nHow to play Basket Bros\n\nSelect your player and pick what to wear - then choose some colors to personalize your drip. You can even select the color of the socks you will be wearing, not to mention the several logos you can apply to your sweat shirt. There are 33 characters to unlock; most of them are inspired by popular NBA figures and have funny names, such as Luka Magic or Step Flurry. Unlock equipment like trainers and balls, as well as special moves, which you will get as you progress in BasketBros.io.\n\nGame Modes\n\nEnter a quick 1vs1 against AI by clicking \"Play Now\" on the main screen.\n\nAlternatively you have:\n\n🏀 2 Players same PC - Allows you to challenge a friend on the same device.\n\n🏀 Franchise Mode - Engage your chosen player in up to 17 matches and lead him to the trophy.\n\n🏀 Shooting Practice - Pretty straightforward: it will ensure you don't get completely overwhelmed when you enter online mode.\n\nYou can also either host or join an online game against a friend of yours; in both cases, you will need to use codes that allow you to play on the same court.\n\nGet playing and into the action straight away. Don't hesitate to take down your opponent, as it's often more effective than trying to block their shot while in the air.\n\nSimilar Games\n\nCheck out our basketball games for more court-based ball battles.\n\nExperience something popular but unrelated by playing Little Alchemy 2 or Idle Breakout.\n\nRelease Date\n\nJanuary 2020\n\nDeveloper\n\nBasketBros is owned by the same developer as ShellShockers.io, Blue Wizard Digital.\n\nPlatform\n\nWeb browser\n\nLast Updated\n\nMar 20, 2025\n\nControls\nWASD + G\nArrows + L\nFAQ\nHow do I host my own multiplayer game?\nClick \"host\" in the main menu and choose your player\nCopy the invite code and send it to your friend\nHow do you block in BasketBros?\n\nYou can block by hitting the spacebar near your opponent.\n\nGameplay Video"
  },
  {
    "id": 6,
    "name": "tap-tap-shots",
    "href": "https://www.crazygames.com/game/tap-tap-shots",
    "link": "https://games.crazygames.com/en_US/tap-tap-shots/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/games/tap-tap-shots/cover-1655202548222.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Tap-Tap Shots\nTap-Tap Shots\nShare\nRating\n8.3\n(23,437 votes)\nReleased\nJune 2019\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nOne Button\n\n82\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMinigames\n\n27\n\nMouse\n\n1,643\nAdvertisement\n\nTap-Tap Shots is an addictive sports game in which you continuously tap to make your basketball jump. It is an endless basketball practice where you aim to get your ball in the net in one shot. The goal is to keep playing until you can't anymore, so you may want to cancel all plans for the evening. Perfectly time your taps to score before the clock runs out, and keep going as long as you can!\n\nHow to Play Tap-Tap Shots\n\nThe gameplay in Tap-Tap Shots is pretty straightforward: it is a one-button game where each click propels your ball. Depending on your tap, your ball may or may not make the shot.\n\nThe net moves to a different height and location each time you make the shot. This will test your click skill. The game, in essence, is an endless series of rounds of practice shots. Your best scores are tallied, incentivizing you to improve upon your performance in the last round.\n\nThe key to the game is to find the right rhythm when tapping, hence the name tap-tap. How many taps do you need to make every shot?\n\nTap-Tap Tips\n\nKeep tapping to move the ball slightly until it reaches the net. If you miss, the ball will come back from the other side.\n\nWhen you score, another net is created in a new location: an endless cycle until you run out of time!\n\nTime your shots carefully and think fast before you run out of time. If you miss, it’s best to click quickly to get back around and try for another shot, but make sure you don’t overshoot again!\n\nGet “On Fire”\n\nWhen you score a few baskets in a row, the ball will become hot and burst into flames. This is an indicator of a successful scoring streak, as well as a way to score bonus points. You can additionally get bonus points for clean shots that don’t touch the rim.\n\nMore Games Like This\n\nFor more basketball games, have a shot at popular titles in our sports category, such as Basketball Stars, which brings fast-paced, one-on-one action.\n\nIf, instead, you want to try something different and enjoy simple, fun games, check out our hypercasual or one-button games for more. Popular games include Geometry Dash, Sprunki, and Little Alchemy.\n\nRelease Date\n\nMarch 2018\n\nDeveloper\n\nMaximiliano Demonte developed Tap-Tap Shots.\n\nPlatforms\n\nWeb browser (desktop and mobile)\n\nControls\n\nLeft-click to dunk.\n\nFAQ\nWhat is the best device to play Tap-Tap Shots on?\n\nSince the game features simple one-click mechanics, it works just as well on mobile and desktop devices.\n\nHow many lives do you have in Tap-Tap Shots?\n\nYou have unlimited lives, but each shot is timed. If you run out of time without scoring, it's game over.\n\nGameplay Video"
  },
  {
    "id": 7,
    "name": "basketball-legends-2020",
    "href": "https://www.crazygames.com/game/basketball-legends-2020",
    "link": "https://games.crazygames.com/en_US/basketball-legends-2020/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketball-legends-2020_16x9/20231122050621/basketball-legends-2020_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Legends 2020\nBasketball Legends 2020\nShare\nDeveloper\nMadPuffers\nRating\n8.5\n(18,966 votes)\nReleased\nSeptember 2020\nLast Updated\nNovember 2023\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\n2 Player\n\n207\n\nBasketball\n\n34\nAdvertisement\n\nBasketball Legends 2020 is the popular sequel to Basketball Stars 2019. This two-player basketball game lets you play as iconic basketball players like Luka Doncic, James Harden, and LeBron James in bobblehead form!\n\nHow to Play Basketball Legends 2020\n\nPlay solo or with a friend\n\nYou can play with a friend in 2-player mode or solo in Basketball Legends 2020. The AI characters are challenging if you’re solo.\n\nUnique teams and abilities\n\nYou can play 1 vs. 1 or 2 vs. 2 matches with various cartoon basketball players. Choose a basketball team that represents your state or one that you support. Each team player has a unique ability.\n\nVarious game modes\n\nYou can play full tournaments, and if you’re looking for a quick game of B-ball, quick play mode has you covered. Train your skills in training and random matches!\n\nClassic basketball moves\n\nBasketball Legends stays true to the spirit of basketball with three-pointers, alley-oops, and epic slam dunks that score you impressive points. Dash around and do epic jump shots to keep your opponent on their toes.\n\nUnique features of Basketball Legends 2020\n\nIn this game, you’ll have the opportunity to perform sci-fi style slam dunks, aka supershots, when the charge on the top left is complete, but be aware that it is not available for each of the available players in the game.\n\nSomething that differentiates Basketball Legends from other titles of the same genre is that each character has specific abilities and, for example, the mega slam dunk won’t be available if you are playing with Steph Curry, who is notoriously a great shooter and a passer but not an acrobatic dunker.\n\nEach player in Basketball Legends can have one of these special abilities:\n\nmega dunk\ndefense\nfast break\n\nSo you’ll need to experiment with all of them and find the special ability that blends better with your style of play.\n\nThere are 16 teams available, each mimicking the logo and name of some of the most popular NBA franchises, and 3 players to choose from within each team. The players also bear an unmistakable resemblance to some of the most famous NBA stars.\n\nMore Games Like This\n\nBasketball Legends 2020 is the perfect game for basketball fans who want to play free sports games on their web browser. You can play the game here at CrazyGames on desktop and mobile devices! It was developed by MadPuffers, the creators of the popular motorbike game, Moto X3M.\n\nOther popular titles to try include Eggy Car or Bubble Shooter.\n\nRelease Date\n\nSeptember 2020\n\nDeveloper\n\nMadPuffers developed Basketball Legends 2020.\n\nPlatform\n\nWeb browser\n\nLast Updated\n\nNov 28, 2023\n\n1 player controls\nAD or left and right arrow keys to move\nX/L to shoot/steal\nS to pump/block\nA+A or D+D or left/right arrow twice to dash\nK/Z to super shot\n2 player controls\nTo move, player 1 use AD and player 2 use left and right arrow keys\nTo shoot/steal, player 1 use B and player 2 use L\nTo pump, player 1 use S and player 2 use down arrow\nTo dash, player 1 use A/D twice and player 2 use left/right arrow twice\nK to super shot\nFAQ\nHow do you dunk in Basketball Legends 2020?\n\nJump and shoot at the hoop to dunk the ball. You can also do a super shot with K/Z.\n\nHow do you play double player on Basketball Legends?\n\nChoose two player match and select the third option under mode to play cooperatively with a friend.\n\nWho are the players in Basketball Legends 2020?\n\nSome of the players in Basketball Legends 2020 include LeBron James, Luka Doncic, James Harden, and other all-stars.\n\nWhat is the basketball legends fun game?\n\nMadPuffers basketball series include Basketball Legends 2019 and Basketball Legends 2020, both popular two-player games with famous players, including LeBron James and James Harden, as bobblehead players.\n\nGameplay Video\nMore Games In This Series\nBasketball Stars"
  },
  {
    "id": 8,
    "name": "basketball-superstars",
    "href": "https://www.crazygames.com/game/basketball-superstars",
    "link": "https://games.crazygames.com/en_US/basketball-superstars/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketball-superstars_16x9/20250117063641/basketball-superstars_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Superstars\nBasketball Superstars\nShare\nDeveloper\nVirtual Projects\nRating\n8.9\n(52,079 votes)\nReleased\nJanuary 2025\nLast Updated\nJune 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nSports\n\n151\n\nMobile\n\n974\n\n3D\n\n1,250\n\nSimulation\n\n533\n\nBall\n\n165\n\nBasketball\n\n34\n\nCrazy Picks\n\n184\nAdvertisement\n\nBasketball Superstars is a dynamic basketball experience where you create and train your ultimate player. Customize your gear, enhance your skills, and face intense rivals in fast-paced matches. Whether you are outsmarting opponents or perfecting your strategy, each game delivers action and excitement as you strive to dominate the court and showcase your prowess.\n\nHow to Play Basketball Superstars\n\nBasketball Stars is a fast-paced, arcade-style basketball game where you compete in one-on-one matches. Use the Arrow Keys to move around the court and dribble past your opponent. Press and hold the Spacebar to shoot, releasing it at the right moment for a perfect shot. If you're close to the hoop, pressing Spacebar will let you perform a slam dunk. On defense, you can steal the ball by getting close to your opponent and tapping Spacebar when they’re dribbling. Time your jumps carefully to block incoming shots.\n\nAggressive play is key in Basketball Stars! When your opponent is on offense, stay close and look for the perfect moment to steal the ball. Time your movements carefully: when they’re dribbling, tap Spacebar to snatch it away. If they go for a shot, jump at the right moment to block it.\n\nOnce you have possession, don’t hesitate, drive toward the hoop and take your shot. Whether you’re aiming for a long-range jumper or a slam dunk, act fast and keep the pressure on. Quick decisions and relentless attacks will keep your opponent on their toes and give you the edge in every match!\n\nAs you play, you’ll earn coins scattered around the court and receive rewards for winning matches. You can claim free daily stars and upgrade your coins, stars, and tickets to enhance your gameplay. Special packs are available for purchase, offering different combinations of tickets, stars, and coins.\n\nPacks include:\n\nSuper Pack 1: 1 ticket, 3 stars, 2,000 coins\nSuper Pack 2 (Most Popular): 1 ticket, 8 stars, 7,500 coins\nSuper Pack 3 (Biggest Boost): 1 ticket, 20 stars, 15,000 coins\n\nCustomization is a key part of the experience, allowing you to change your basketball outfit and modify your character’s appearance. Your performance is graded based on defense, shooting, speed, and dunking, so strategize your playstyle to dominate the court!\n\nMore Games Like This\n\nStay in the game and explore some of our most exciting sports titles, including popular soccer games like Soccer Random, a two-player, one-button soccer game with random physics and hilarious goals.\n\nWant to switch from field to court? Try Basketbros, a fast, fun basketball game with solo and online modes, or Basket Random, a 2-player arcade sports game with unpredictable physics and non-stop fun.\n\nLast Updated\n\nJun 03, 2025\n\nControls\nMove = Use the Arrow Keys to dribble and navigate around the court.\nShoot = Press and hold the Spacebar, then release it at just the right moment to score.\nDunk = Get close to the hoop and press the Spacebar to slam it home with style!\nSteal = Get close to your opponent and tap the Spacebar to steal the ball.\nBlock = Tap the Spacebar at just the right time to block your opponent’s shot.\nFAQ\nWhere can I play Basketball Superstars?\n\nYou can play Basketball Superstars online and for free at CrazyGames.\n\nHow to play Basketball Superstars on computer?\n\nIn Basketball Stars, use Arrow Keys to move, Spacebar to shoot or dunk, steal by tapping Spacebar while close to your opponent, and block shots with precise jumps.\n\nGameplay Video"
  },
  {
    "id": 9,
    "name": "hoop-world-3d",
    "href": "https://www.crazygames.com/game/hoop-world-3d",
    "link": "https://games.crazygames.com/en_US/hoop-world-3d/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/hoop-world-3d_16x9/20250616033341/hoop-world-3d_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Hoop World 3D\nHoop World 3D\nShare\nDeveloper\nTapNation\nRating\n8.8\n(18,193 votes)\nReleased\nApril 2024\nLast Updated\nJune 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nSports\n\n151\n\nOne Button\n\n82\n\n3D\n\n1,250\n\nJumping\n\n150\n\nBall\n\n165\n\nBasketball\n\n34\n\nCrazy Picks\n\n184\n\nMouse\n\n1,644\nAdvertisement\n\nHoop World 3D is a flip-and-dunk game that brings basketball to a whole new dimension! Get your timing right or you'll fall short of the net and fall flat on your face.\n\nHow to Play Hoop World 3D\n\nHoop World 3D is fairly easy to maneuver and easy to learn. Use your mouse or keypad to control movement with just one finger.\n\nThis game will challenge you to flip, dunk, and soar right towards the net. Test your skills, and your flips to progress to the next level, but keep in mind the more flips you do, the quicker you progress to the next level.\n\nHow do you master your triple-front flip dunks, you ask? To flip the ball and aim for a dunk, you will need to tap the controls. Hold the left mouse button to jump and flip, and then release to dunk. You will have a few challenges along the way like trampolines, slides and more.\n\nWith simple controls and stunning graphics, it's addictive and exhilarating. Jump, dunk, and explore thrilling environments. Just watch out for those falls!\n\nRelease Date\nSeptember 2021 (iOS)\nOctober 2021 (Android)\nApril 2024 (WebGL)\nPlatforms\nWeb browser (desktop and mobile)\nAndroid\niOS\nMore Games Like This\n\nWant more games to practice your jump shots? Check out our extensive selection of sports games and try popular basketball games like Basketball Stars, Basketball Random and Basket Bros to better your game.\n\nLast Updated\n\nJun 16, 2025\n\nControls\n\nHold the left mouse button to jump and flip, and then release to dunk.\n\nFAQ\nWhat can I do with my coins in Hoop World 3D?\n\nYou can continue collecting coins in Hoop World 3D and see them as points rather than coins to purchase something with.\n\nCan I play Hoop World 3D online?\n\nYes, you can play Hoop World 3D online at CrazyGames."
  },
  {
    "id": 10,
    "name": "basketball-skills",
    "href": "https://www.crazygames.com/game/basketball-skills",
    "link": "https://games.crazygames.com/en_US/basketball-skills/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/games/basketball-skills/cover_16x9-1734346245128.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Skills\nBasketball Skills\nShare\nRating\n9.2\n(1,788 votes)\nReleased\nApril 2019\nLast Updated\nSeptember 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nPhysics\n\n351\n\nBall\n\n165\n\nBasketball\n\n34\n\nMouse\n\n1,643\nAdvertisement\n\nBasketball Skills is the basketball arcade game in which you must try to score baskets in all the different game modes available. You can play either arcade, time attack, and distance mode. Arcade mode gives you 10 balls to use; you must continue to score baskets although it becomes harder each time you score.\n\nTime attack mode requires you to score as many baskets within the time limit as possible; you have unlimited balls but limited time. Distance mode allows you to increase the distance of your shot each time that you score. The distance decreases every time you miss a shot, don’t let the distance reach zero; otherwise, it is game over. Good luck!\n\nRelease Date\n\nThe game was initially released in August 2018 was updated with various improvements in April 2019. It is published exclusively on CrazyGames.com.\n\nFeatures\nA cool basketball game suitable for starters and pros\n3 awesome game modes with different gameplay\nRealistic physics\nNice sound effects and engaging music\nPlayable smoothly in fullscreen\nPlatform\n\nWeb browser\n\nLast Updated\n\nSep 03, 2025\n\nControls\nDrag left mouse button to aim, release to shoot\nR to restart"
  },
  {
    "id": 11,
    "name": "basket-battle-zmg",
    "href": "https://www.crazygames.com/game/basket-battle-zmg",
    "link": "https://games.crazygames.com/en_US/basket-battle-zmg/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basket-battle-zmg_16x9/20250102082146/basket-battle-zmg_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basket Battle\nBasket Battle\nShare\nRating\n8.9\n(15,109 votes)\nReleased\nJanuary 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nSports\n\n151\n\nMobile\n\n972\n\nBattle\n\n483\n\nBasketball\n\n34\n\nMouse\n\n1,642\n\nArcade\n\n406\nAdvertisement\n\nBasket Battle is a dynamic sports basketball game where you aim to outscore your opponent by skillfully throwing the ball into the basket. Challenge your reflexes as you intercept your rival's shots and maintain control over the game: master timing and precision to dominate the court and secure victory in intense matches.\n\nHow to Play Basket Battle\n\nBasket Battle is a fast-paced, action-packed game that puts your basketball skills and strategic thinking to the ultimate test. Your objective is simple: shoot the basketball into the hoop before your opponent does. But don’t let this simplicity fool you, this game is packed with twists, surprises, and escalating challenges that will keep you on your toes.\n\nThe gameplay starts with intuitive controls that let you tap, aim, and launch your basketball toward the hoop. You want to score, but it's not just about scoring. You’ll need to outmaneuver your opponents, disrupt their shots, and position yourself strategically to stay ahead. Bumping into their basketball mid-air or intercepting their trajectory can give you the edge in tight matches. Each level introduces new obstacles and mechanics, keeping the gameplay fresh and dynamic.\n\nCustomization adds another layer of fun to Basket Battle. Unlock unique skins for your basketballs and players, showing off your style as you dominate the court. Power-ups and upgrades let you fine-tune your gameplay, whether it’s enhancing your shooting accuracy, boosting your speed, or adding special effects to your shots. These features keep players engaged as they climb the ranks from beginner to seasoned pro.\n\nFor those seeking a more significant challenge, the game offers tournaments where you can test your skills against tougher opponents and earn rare rewards. Advanced techniques, like shooting from tricky angles or bouncing the ball off walls for dramatic shots, allow for creative gameplay that can surprise even seasoned players.\n\nMore Games Like This\n\nThere are plenty more sports games to get you in digital shape. Have a go at Bowman, a simple archery duel, or Basketball Stars or Basketball Legends where you shoot some hoops with the professionals like LeBron James.\n\nControls\n\nUse the Left Mouse Button to interact.\n\nFAQ\nCan you play tournaments in Basket Battle?\n\nYes, there is a tournament mode available in Basket Battle.\n\nCan I play Basket Battle on my phone?\n\nYou can play Basket Battle on your phone or desktop. It is available online and is created for mobile-friendly gameplay.\n\nGameplay Video"
  },
  {
    "id": 12,
    "name": "ragdoll-throw-challenge",
    "href": "https://www.crazygames.com/game/ragdoll-throw-challenge",
    "link": "https://games.crazygames.com/en_US/ragdoll-throw-challenge/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/ragdoll-throw-challenge_16x9/20240520080923/ragdoll-throw-challenge_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Casual»Action»Ragdoll»Ragdoll Throw Challenge\nRagdoll Throw Challenge\nShare\nDeveloper\nPeachHouse\nRating\n8.2\n(19,742 votes)\nReleased\nMay 2024\nLast Updated\nJune 2024\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nCasual\n\n1,267\n\nPhysics\n\n351\n\nBasketball\n\n34\n\n2D\n\n975\n\nObstacle\n\n292\n\nStickman\n\n189\n\nArchery\n\n52\n\nRagdoll\n\n54\nAdvertisement\n\nRagdoll Throw Challenge is a physics-based casual game where you control a wobbly character, help them grab weapons, and fling them at your enemies for ultimate chaos and fun! The gameplay is simple, but movements can be complex and challenging to master.\n\nHow to Play Ragdoll Throw Challenge\n\nThere are several challenges you can choose from at the start of the game, all of which are quite different from each other but have a common thread: simple physical movements with very big repercussions. You can choose from various gameplays:\n\nBow and Arrow\n\nYour ragdoll is standing on a ledge with a bow and arrow. Rotate your arms clockwise or counterclockwise, point, shoot, and aim. You won't always get your opponent to fall off the game screen when struck. Depending on the intensity of the hit, you may need a few arrows. Each challenge gets harder with ragdolls at various points on the game screen.\n\nDynamite\n\nThis challenge can be trickier. Your ragdoll's mission is to grab dynamite and throw it towards your opponent. Are you throwing it too far, too close, over the edge? You must find that perfect balance of rotating your hands, grabbing the object, and letting go to get to the next challenge. Easier said than done.\n\nSimple Arrow\n\nClick the play button at the start of the game, and you will be equipped with a simple arrow. This challenge will teach you the basics of this game. The arrow and movements very much mirror those of the Dynamite challenge.\n\nBasketball\n\nYou aim to dunk the ball in the hoop. How much force is needed to shoot, and how far should you be before letting go of the ball? Practice makes perfect in this challenge.\n\nCannon\n\nHold, release, and fire! You will shoot your ragdoll out of a cannon and get him safely on a platform. Don't be afraid to hit him against other platforms to lose a bit of force and gain a bit of direction - all for the sake of physics!\n\nIn-Game Shop\n\nEvery successfully completed challenge earns you one golden coin. When you have enough, you can spend them in the shop and buy cosmetic improvements for your character: you can purchase hats, t-shirts, gloves, and trousers. These do not affect the playability of the game but only its aesthetics.\n\nRelease Date\nAugust 2019 (Android)\nMay 2021 (iOS)\nMay 2024 (WebGL)\nPlatforms\nWeb browser (desktop and mobile)\nAndroid\niOS\nMore Games Like This\n\nExplore our selection of casual games for more fun options. Try games like Snow Rider, where you will conduct a bobsled on a dangerous mountain; Agario, an io game where you help your single-cell character grow larger if you care for it; or Eggy Car, where you ride a car with an egg on top on hilly terrain.\n\nLast Updated\n\nJun 04, 2024\n\nControls\nAD or arrow keys to rotate hands\nSpace to grab weapons, release to throw\nLeft mouse button to interact with in-game UI, and see the full in-game controls\nFAQ\nIs Ragdoll Throw Challenge game free?\n\nYou can play Ragdoll Throw Challenge for free at CrazyGames.\n\nHow to play Ragdoll Throw Challenge?\n\nUse the A and D keys or arrow keys to rotate your character's hands and the space bar to grab objects and release them. The key is to find the right balance of force and release.\n\nGameplay Video"
  },
  {
    "id": 13,
    "name": "basketball-clash",
    "href": "https://www.crazygames.com/game/basketball-clash",
    "link": "https://games.crazygames.com/en_US/basketball-clash/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketball-clash/20230705135545/basketball-clash-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Clash\nBasketball Clash\nShare\nDeveloper\nMirra Games\nRating\n8.8\n(2,879 votes)\nReleased\nJuly 2023\nLast Updated\nJuly 2023\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS)\n\nSports\n\n151\n\n3D\n\n1,250\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMouse\n\n1,644\nAdvertisement\n\nBasketball Clash is the ultimate basketball game that brings together players from around the globe, providing endless entertainment. Showcase your talent and rise among the top 100 basketball shooters worldwide. Prepare for exhilarating competitions where your agility, logic, and strategic thinking will determine your triumph. Prove your skills and dominate the court!\n\nRelease Date\nMarch 2019 (iOS)\nJuly 2023 (HTML5)\nDeveloper\n\nMirra games made Basketball Clash.\n\nPlatforms\nWeb browser (desktop and mobile)\niOS\nLast Updated\n\nJul 13, 2023\n\nControls\n\nDrag and release the left mouse button to shoot the ball."
  },
  {
    "id": 14,
    "name": "basketball-league",
    "href": "https://www.crazygames.com/game/basketball-league",
    "link": "https://games.crazygames.com/en_US/basketball-league/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketball-league_16x9/20250630074606/basketball-league_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball League\nBasketball League\nShare\nDeveloper\nYilmaz Kiymaz\nRating\n8.8\n(2,756 votes)\nReleased\nNovember 2023\nLast Updated\nJuly 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nMobile\n\n974\n\n3D\n\n1,250\n\nBasketball\n\n34\n\nSkill\n\n247\n\nMouse\n\n1,644\n\nMultiplayer\n\n351\n\nArcade\n\n406\nAdvertisement\n\nBasketball League is an arcade basketball sports game where you must aim and shoot to score. If you want relaxing gameplay, you can try the Free Throw mode. If you want to challenge yourself, you can play the Timed Practice mode. If you want to show your skill and prove yourself to others, play the Online mode so everybody will know how talented you are!\n\nRelease Date\n\nNovember 2023\n\nPlatform\n\nWeb browser (desktop and mobile)\n\nLast Updated\n\nJul 02, 2025\n\nControls\n\nMove the mouse to aim and click the left mouse button to shoot."
  },
  {
    "id": 15,
    "name": "basket-champs",
    "href": "https://www.crazygames.com/game/basket-champs",
    "link": "https://games.crazygames.com/en_US/basket-champs/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketchamps.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basket Champs\nBasket Champs\nShare\nDeveloper\nRavalMatic\nRating\n8.7\n(2,060 votes)\nReleased\nDecember 2016\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nBasketball\n\n34\nAdvertisement\nBasket Champs is a fun basketball game! Pick your favorite team and compete in the tournament by scoring more points than your opponents.\nRelease Date\nDecember 2016\nDeveloper\nBasket Champs was made by RavalMatic.\nPlatforms\nWeb browser (desktop and mobile)"
  },
  {
    "id": 16,
    "name": "flipper-dunk-3d",
    "href": "https://www.crazygames.com/game/flipper-dunk-3d",
    "link": "https://games.crazygames.com/en_US/flipper-dunk-3d/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/flipper-dunk-3d/20230102160902/flipper-dunk-3d-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Casual»Flipper Dunk 3D\nFlipper Dunk 3D\nShare\nDeveloper\nArmath\nRating\n8.7\n(3,657 votes)\nReleased\nDecember 2022\nLast Updated\nJanuary 2023\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nCasual\n\n1,267\n\nOne Button\n\n82\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMouse\n\n1,643\n\nArcade\n\n406\n\nFlipper Dunk 3D is a challenging single-tap pinball-basketball game. You'll need the patience of a monk and the precision of a master to dunk. See if you have what it takes to be a master dunker. The game is simple to learn but difficult to master, but it will be highly satisfying when you finally dunk that ball! Check out Tap Tap Shots for a similar game.\n\nRelease Date\n\nDecember 2022\n\nDeveloper\n\nFlipper Dunk 3D was made by Armath.\n\nPlatform\n\nWeb browser (desktop and mobile)\n\nLast Updated\n\nJan 27, 2023\n\nControls\n\nUse the left mouse button to use the flap."
  },
  {
    "id": 17,
    "name": "basketball-frvr",
    "href": "https://www.crazygames.com/game/basketball-frvr",
    "link": "https://games.crazygames.com/en_US/basketball-frvr/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketballfrvr.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball FRVR\nBasketball FRVR\nShare\nDeveloper\nChris Benjaminsen\nRating\n9.0\n(2,509 votes)\nReleased\nFebruary 2017\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(Android)\n\nSports\n\n151\n\nBasketball\n\n34\n\nMouse\n\n1,644\nAdvertisement\nBasketball FRVR is a great new basketball game that you can play on any device. This Basketball Hoop Shooter is simple to learn but a lot of fun. There is no time limit in the game, but the moving basket is a challenge even for experienced players! This means that you can play Basketball FRVR for as long as you want. There are bonus points if you don't hit the rim. The game is made by Chris Benjaminsen. Have fun!\n\nDrag mouse up side to throw the ball.\n\nMore Games In This Series\nSolitaire FRVR\nHex FRVR\nMahjong FRVR\nCave FRVR\nGold Digger FRVR"
  },
  {
    "id": 18,
    "name": "flappy-dunk",
    "href": "https://www.crazygames.com/game/flappy-dunk",
    "link": "https://games.crazygames.com/en_US/flappy-dunk/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/flappy-dunk_16x9/20231204133706/flappy-dunk_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Casual»Sports»Ball»Flappy Dunk\nFlappy Dunk\nShare\nDeveloper\nVoodoo\nRating\n8.5\n(5,324 votes)\nReleased\nDecember 2023\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nCasual\n\n1,267\n\nOne Button\n\n82\n\nAvoid\n\n284\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMouse\n\n1,644\nAdvertisement\n\nFlappy Dunk is a casual basketball game where you tap to propel the ball through hoops, earning points and unlocking new balls along the way. The game seamlessly blends simple one-touch controls with a challenging gameplay that's easy to grasp but hard to master. Perfect for basketball enthusiasts of all ages, Flappy Dunk keeps the excitement alive with its unique theme and a continuous stream of fresh challenges as you progress.\n\nRelease Date\nMay 2017 (iOS)\nJuly 2017 (Android)\nAugust 2017(HTML5)\nPlatforms\nWeb browser (desktop and mobile)\nAndroid\niOS\nControls\n\nUse the left mouse button to control the basketball."
  },
  {
    "id": 19,
    "name": "basket-ball",
    "href": "https://www.crazygames.com/game/basket-ball",
    "link": "https://games.crazygames.com/en_US/basket-ball/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basket-ball/20230303113513/basket-ball-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Casual»Sports»Basketball»Basket-Ball\nBasket-Ball\nShare\nDeveloper\nG4AA Games\nRating\n8.9\n(1,338 votes)\nReleased\nFebruary 2023\nLast Updated\nMarch 2023\nTechnology\nHTML5 (Unity WebGL)\nPlatform\nBrowser (desktop, mobile, tablet)\n\nCasual\n\n1,267\n\nPhysics\n\n351\n\nBall\n\n165\n\nBasketball\n\n34\n\n2D\n\n975\n\nSkill\n\n247\n\nArcade\n\n406\nAdvertisement\n\nBasket-Ball is a 2D arcade basketball game where you must throw the ball in one shot and be able to catch the star and put the ball into the basket. Avoid obstacles that get in the way and use the portal to teleport the ball. Proof your skill and challenge yourself by beating all the levels available. This game is designed for your fun!\n\nRelease Date\n\nFebruary 2023\n\nDeveloper\n\nG4AA Games made this game.\n\nPlatform\n\nWeb browser\n\nLast Updated\n\nMar 03, 2023\n\nControls\n\nDrag the left mouse button to aim and release to shoot the ball."
  },
  {
    "id": 20,
    "name": "basket-slam-dunk-2",
    "href": "https://www.crazygames.com/game/basket-slam-dunk-2",
    "link": "https://games.crazygames.com/en_US/basket-slam-dunk-2/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/games/basket-slam-dunk-2/thumb-1581588989893.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basket Slam Dunk 2\nBasket Slam Dunk 2\nShare\nDeveloper\nIxel Games\nRating\n8.8\n(1,308 votes)\nReleased\nFebruary 2020\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(Android)\n\nSports\n\n151\n\nPixel\n\n322\n\nDifficult\n\n80\n\nPhysics\n\n351\n\nBasketball\n\n34\n\n2D\n\n975\n\nMultiplayer\n\n351\n\nJust like Tap Tap Shots, in Basket Slam Dunk 2, you need to successfully dunk the basketball into the ring. The physics element makes the game more challenging!\n\nRelease Date\n\nDecember 2019 (Android). January 2020 (HTML5).\n\nDeveloper\n\nIxel Games developed Basket Slam Dunk 2.\n\nPlatforms\nWeb browser (desktop and mobile)\nAndroid\nControls\nHold left mouse button to adjust jumping power, release to jump\nPress left mouse button to dunk"
  },
  {
    "id": 21,
    "name": "basket-swooshes-plus",
    "href": "https://www.crazygames.com/game/basket-swooshes-plus",
    "link": "",
    "icon": "https://imgs.crazygames.com/basket-swooshes-plus_16x9/20231107033245/basket-swooshes-plus_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": ""
  },
  {
    "id": 22,
    "name": "basketball-shot",
    "href": "https://www.crazygames.com/game/basketball-shot",
    "link": "https://games.crazygames.com/en_US/basketball-shot/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basketball-shot_16x9/20251028061632/basketball-shot_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Shot\nBasketball Shot\nShare\nDeveloper\nDoonDookStudio\nRating\n8.0\n(245 votes)\nReleased\nOctober 2025\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nOne Button\n\n82\n\nMobile\n\n973\n\nPhysics\n\n351\n\nBall\n\n165\n\nBasketball\n\n34\n\n2D\n\n974\n\nBasketball Tap is a fast-paced sports game that tests your timing and precision. You’ll tap to launch the ball, aim for perfect arcs, and land satisfying slam dunks. Each shot pushes your reflexes to the limit as you chase higher scores, master tricky angles, and rise through the ranks like a true basketball pro.\n\nControls\n\nUse the left mouse button or space to bounce the ball."
  },
  {
    "id": 23,
    "name": "jump-up-3d-mini-basketball",
    "href": "https://www.crazygames.com/game/jump-up-3d-mini-basketball",
    "link": "https://games.crazygames.com/en_US/jump-up-3d-mini-basketball/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/jump-up-3d-mini-basketball_16x9/20240429062741/jump-up-3d-mini-basketball_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Jump Up 3D: Mini Basketball\nJump Up 3D: Mini Basketball\nShare\nDeveloper\nFuntory\nRating\n8.9\n(1,618 votes)\nReleased\nMay 2024\nLast Updated\nMay 2024\nTechnology\nHTML5 (Unity WebGL)\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nOne Button\n\n82\n\n3D\n\n1,250\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMouse\n\n1,644\n\nJump Up 3D: Mini Basketball is a trampoline basketball game where you control the action. With simple controls, anyone can enjoy aiming for that perfect shot. The vibrant graphics and lively animations make each game session a blast. Challenge yourself to beat your high score or compete with friends for bragging rights. It's time to bounce, shoot, and score big in Jump Up 3D: Mini Basketball!\n\nRelease Date\n\nApril 2024\n\nPlatform\n\nWeb browser (desktop and mobile)\n\nLast Updated\n\nMay 10, 2024\n\nControls\n\nUse the left mouse button to shoot.\n\nMore Games In This Series\nJump Up 3D"
  },
  {
    "id": 24,
    "name": "street-ball-jam",
    "href": "https://www.crazygames.com/game/street-ball-jam",
    "link": "https://games.crazygames.com/en_US/street-ball-jam/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/games/street-ball-jam/thumb-1568117124451.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Street Ball Jam\nStreet Ball Jam\nShare\nDeveloper\nMaksim Eliseenko\nRating\n8.5\n(1,239 votes)\nReleased\nSeptember 2019\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nBall\n\n165\n\nBasketball\n\n34\n\nMouse\n\n1,644\nAdvertisement\nStreet Ball Jam is an entertaining one-touch basketball game to score as many balls as you can.\nRelease Date\nMarch 2017\nDeveloper\nStreet Ball Jam was made by Maksim Eliseenko.\nPlatform\nWeb browser (desktop and mobile)\nControls\nHold left mouse button to aim, release to shoot."
  },
  {
    "id": 25,
    "name": "jump-up-3d-basketball-game",
    "href": "https://www.crazygames.com/game/jump-up-3d-basketball-game",
    "link": "https://games.crazygames.com/en_US/jump-up-3d-basketball-game/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/jump-up-3d-basketball-game_16x9/20240930101128/jump-up-3d-basketball-game_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Jump Up 3D\nJump Up 3D\nShare\nDeveloper\nFuntory Studio\nRating\n9.2\n(943 votes)\nReleased\nSeptember 2023\nLast Updated\nSeptember 2024\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nSports\n\n151\n\n3D\n\n1,250\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMouse\n\n1,644\n\nJump Up 3D is a sports basketball game where you shoot to get that slam dunk, but the one hitch is you're doing it by jumping on a trampoline. Not your ordinary basketball game, this one promises and delivers the excitement! Take aim, bounce on the trampoline, and score baskets before your opponent. With intuitive controls and addictive gameplay, it tests your precision and unleashes your inner dunk master. Be the court champion in this fast-paced! How far can you go in this unlimited playground of basketball action?\n\nHow to Play Jump Up 3D\n\nThe game's objective is simple—sink as many basketball shots as you can with a single click. In the first round, you're perched on top of a skyscraper, aiming for a single hoop. Press the spacebar to shoot when your trampoline jump is perfectly aligned for a slam dunk. The key to mastering this physics-based game is timing—wait for the perfect moment in your jump before hitting the spacebar to release the ball. Nail the shot, and you’ll be launched across the hoop, celebrating your victory with a dance alongside other players.\n\nIn the second round, you’ll team up with another basketball player, still aiming for just one hoop. But in the third round, things get more intense as you aim for three-point shooting success. Now, you’ll have three hoops at different distances—the farther you sink the shot, the higher the score. By round 4, you'll be shooting from the beach! The pace picks up, and so do the rewards, both in gameplay and points. Dunk as many as you can and watch your player soar. Round 5 ups the challenge with hoops that move up and down, making timing your shots even trickier. Round 6 keeps the pressure on with rotating basketball posts. Get creative, shoot fast, and aim for those multi-shot combos!\n\nSome hoops are blocked, but all it takes is breaking through the barrier to nail your shot.\n\nThe levels get more challenging but increase in fun as well. Keep shooting as much as possible and gain an advantage over your opponent to become a three-point shooting basketball champ.\n\nMore Games Like This\n\nIf you enjoy the energetic gameplay of Jump Up 3D, there are plenty of other sports games to try out! Basketball Stars lets you showcase your skills in intense one-on-one basketball matches with smooth controls and exciting moves. Basket Random offers a hilarious twist on the sport, where unpredictable physics and random challenges keep each game fresh and fun. Basketball Legends allows you to compete as famous players in thrilling matches, using special moves and teamwork to dominate the court.\n\nRelease Date\nJanuary 2021 (Android)\nJuly 2022 (iOS)\nSeptember 2023 (WebGL)\nDeveloper\n\nFuntory Studio developed Jump Up 3D: Basketball game. You can support the developer's social media channels on Twitter and YouTube.\n\nPlatforms\nWeb browser\nAndroid\niOS\nLast Updated\n\nSep 30, 2024\n\nControls\n\nUse the left mouse button to shoot.\n\nFAQ\nWhat is 3D basketball?\n\nJump Up 3D is a sports basketball game where you shoot to get that slam dunk, as you compete with random opponents to make your way victory.\n\nWhat does 3D mean in basketball?\n\n3D is three-point shooting in basketball.\n\nGameplay Video\nMore Games In This Series\nJump Up 3D: Mini Basketball"
  },
  {
    "id": 26,
    "name": "sport-minibattles",
    "href": "https://www.crazygames.com/game/sport-minibattles",
    "link": "https://games.crazygames.com/en_US/sport-minibattles/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/sport-minibattles/20200731163003/sport-minibattles-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Multiplayer»2 Player»Sports Minibattles\nSports Minibattles\nShare\nDeveloper\nShared Dreams\nRating\n8.1\n(575 votes)\nReleased\nNovember 2018\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(Android)\n\nSports\n\n151\n\n2 Player\n\n207\n\nSoccer\n\n55\n\nPhysics\n\n351\n\nBasketball\n\n34\nAdvertisement\n\nSports Mini Battles is a brilliant collection of sports-based games. You can either play against an AI computer opponent or your friend using split controls. There are four different sports games to play. During each game, you must try and beat your opponent in an intense sports match.\n\nIn each game, the first player to score five times wins so stay alert and try to make every point or play count! The 2D graphics are cool, and the physics of the game make it entertaining. If you enjoy this game why not try 12 MiniBattles which is a similar physics-based game.\n\nRelease Date\n\nApril 2018 (Android). November 2018 (HTML5).\n\nDeveloper\n\nMariano Maffia made Sport Minibattles.\n\nFeatures\nFour random sports games to play: soccer, basketball, tennis, and volleyball\nPlay solo or against your friend\n2D graphics with a cool physics\nSimple controls\nRandom obstacles in the match\nPlatforms\n\nSports Minibattles is a web browser game (desktop and mobile). It's also available as an Android app.\n\nSingle Player Controls\nPress left and right arrow to move\nPress up arrow to jump\nPress A to smash\nTwo Players Controls\nTo move, player 1 use AD and player 2 use left and right arrow\nTo jump, player 1 use W and player 2 use up arrow\nTo smash, player 1 use space bar and player 2 use 0 or enter"
  },
  {
    "id": 27,
    "name": "flipped-chain-dunk",
    "href": "https://www.crazygames.com/game/flipped-chain-dunk",
    "link": "https://games.crazygames.com/en_US/flipped-chain-dunk/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/flipped-chain-dunk_16x9/20240624062820/flipped-chain-dunk_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Casual»Jumping»Flipped Chain Dunk\nFlipped Chain Dunk\nShare\nDeveloper\nOziTech\nRating\n9.4\n(1,730 votes)\nReleased\nJune 2024\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop-only), App Store(Android)\n\nCasual\n\n1,267\n\nJumping\n\n150\n\nBasketball\n\n34\n\n2D\n\n975\n\nCollect\n\n547\n\nFlipped Chain Dunk is a thrilling game where you jump, flip, and make chains to slam insane dunks. Tap the screen to move from ring to ring, creating a chain of players carrying a basketball. Tap again to leap into the Dunk and complete each level. Get ready for an exciting chain dunk adventure!\n\nRelease Date\nMay 2023 (Android)\nJune 2024 (WebGL)\nPlatforms\nWeb browser\nAndroid\nControls\n\nUse the left mouse button to play the game."
  },
  {
    "id": 28,
    "name": "noob-basketball-clicker",
    "href": "https://www.crazygames.com/game/noob-basketball-clicker",
    "link": "https://games.crazygames.com/en_US/noob-basketball-clicker/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/noob-basketball-clicker_16x9/20240529065332/noob-basketball-clicker_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Clicker»Sports»Basketball»Noob Basketball Clicker\nNoob Basketball Clicker\nShare\nDeveloper\nNeko\nRating\n9.2\n(1,125 votes)\nReleased\nMay 2024\nLast Updated\nJuly 2024\nTechnology\nHTML5 (Unity WebGL)\nPlatform\nBrowser (desktop, mobile, tablet)\n\nClicker\n\n315\n\nMobile\n\n974\n\nPixel\n\n322\n\nBasketball\n\n34\n\n2D\n\n975\n\nIncremental\n\n330\n\nMouse\n\n1,644\n\nIdle\n\n403\nAdvertisement\n\nNoob Basketball Clicker is a fun and addicting clicker game that combines with unique basketball elements. Your goal is to manage the basketball court and earn money by shooting the ball into the basket. Just click your mouse to send the ball flying toward the hoop. Each hit will bring you profit, which you can use to improve your gaming experience. Develop your skills, acquire new balls, and expand your support team to increase your income. This game offers addictive gameplay that will keep you busy for hours. Immerse yourself in a competitive atmosphere and test your business management skills. Become a real basketball tycoon and conquer this virtual sport!\n\nRelease Date\n\nMay 2024\n\nPlatform\n\nWeb browser\n\nLast Updated\n\nJul 04, 2024\n\nControls\n\nUse the left mouse button to interact with the in-game UI."
  },
  {
    "id": 29,
    "name": "epic-basketball",
    "href": "https://www.crazygames.com/game/epic-basketball",
    "link": "https://games.crazygames.com/en_US/epic-basketball/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/epic-basketball/20200803042523/epic-basketball-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Epic Basketball\nEpic Basketball\nShare\nDeveloper\nShared Dreams\nRating\n8.8\n(459 votes)\nReleased\nAugust 2020\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\n1 Player\n\n149\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nLol\n\n44\n\nMouse\n\n1,644\nAdvertisement\nEpic Basketball is an entertaining arcade-style basketball game with crazy characters.\nRelease Date\nAugust 2020\nDeveloper\nEpic Basketball was made by Shared Dreams, the same developer who made a fantastic 2 player game, 12 MiniBattles.\nPlatform\nWeb browser (desktop and mobile)\nControls\n\nHold the left mouse button, drag to aim, release to launch the ball."
  },
  {
    "id": 30,
    "name": "basket-monsterz",
    "href": "https://www.crazygames.com/game/basket-monsterz",
    "link": "https://games.crazygames.com/en_US/basket-monsterz/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/basket-monsterz/20221028193744/basket-monsterz-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basket Monsterz\nBasket Monsterz\nShare\nDeveloper\nDParrot\nRating\n8.4\n(397 votes)\nReleased\nOctober 2022\nLast Updated\nOctober 2022\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nBasketball\n\n34\n\nMonster\n\n209\n\nMouse\n\n1,644\n\nMultiplayer\n\n351\nAdvertisement\n\nBasket Monsterz is an awesome basketball shooting game with fun cartoon monster characters! You can play as a wide range of monsters including Satan and Bigfoot. Get in the game and see if you can win.\n\nHow to Play\nShoot spooky hoops\n\nPlay in a basketball tournament and work your way through each stage by playing 1on1 matches against other monsters. During each match you must attempt to score as many baskets as possible in the allotted time.\n\nLine up your shots\n\nUse your mouse to aim your shot, generate power and align the correct shooting arc. Once you have lined up your shot, click the left mouse button to release it! For every basket you score, you gain one point. The winner is the first to reach 11 points.\n\nBuy new monsters!\n\nAs you win matches you accumulate stars. You can use these stars to purchase new monster characters! Can you hone your basketball skills and win the monster tournament? Play Basket Monsterz to find out.\n\nCheck out the basketball games section for more basketball games. If you're looking for a spooky theme, browse our halloween and horror games.\n\nPlatforms\n\nYou can play this game online either on desktop or mobile browser.\n\nDeveloper\n\nBasket Monsterz is developed by DParrot.\n\nLast Updated\n\nOct 28, 2022\n\nControls\n\nMove your mouse to aim, left click to shoot."
  },
  {
    "id": 31,
    "name": "puzzle-survivor",
    "href": "https://www.crazygames.com/game/puzzle-survivor",
    "link": "https://games.crazygames.com/en_US/puzzle-survivor/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/puzzle-survivor_16x9/20250616040010/puzzle-survivor_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Puzzle»Word»Puzzle Survivor\nPuzzle Survivor\nShare\nDeveloper\nDemir\nRating\n8.2\n(546 votes)\nReleased\nApril 2025\nLast Updated\nJune 2025\nTechnology\nHTML5 (Unity WebGL)\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(Android)\n\nPuzzle\n\n659\n\nMobile\n\n973\n\nWord\n\n44\n\nRunning\n\n100\n\nBasketball\n\n34\n\nStrategy\n\n388\n\nMath\n\n30\n\nBrain\n\n215\nAdvertisement\n\nPuzzle Survivor is a competitive puzzle game that puts your logic and strategy to the test. Solve word and number challenges across multiple game modes, compete in real-time or turn-based battles, and climb the leaderboards. Take on daily challenges, unlock achievements, and sharpen your mind in fast-paced, brain-training duels!\n\nLast Updated\n\nJun 16, 2025\n\nControls\n\nUse the Left Mouse Button to interact."
  },
  {
    "id": 32,
    "name": "bouncy-dunk",
    "href": "https://www.crazygames.com/game/bouncy-dunk",
    "link": "https://games.crazygames.com/en_US/bouncy-dunk/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/bouncydunk.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Casual»Jumping»Bouncy Dunk\nBouncy Dunk\nShare\nDeveloper\nGamePix\nRating\n8.4\n(282 votes)\nReleased\nAugust 2018\nTechnology\nHTML5\nPlatform\nBrowser (desktop, mobile, tablet)\n\nCasual\n\n1,267\n\nJumping\n\n150\n\nBasketball\n\n34\n\nBouncy Dunk is the arcade basketball game in which you must try to score as many baskets as possible. The ball will come from different directions, use the clicker on your mouse to make the ball bounce and score into the basket. Your timing as key as you must work out the protectory of the ball as it approaches the rim.\n\nTest your basketball skills by dunking as many balls as you can, there are unique challenges to complete that will push you even further. As you progress you can unlock awesome balls to use that increase your power and more importantly your style. Have fun!\n\nRelease Date\nAugust 2018\nFeatures\nUnlock up to 24 different basketballs.\nGet on a streak and become HOT!\nPlatforms\nWeb browser (desktop and mobile)\nControls\nTap or click"
  },
  {
    "id": 33,
    "name": "rogue-dunk-viy",
    "href": "https://www.crazygames.com/game/rogue-dunk-viy",
    "link": "https://games.crazygames.com/en_US/rogue-dunk-viy/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/rogue-dunk-viy_16x9/20240919102006/rogue-dunk-viy_16x9-cover?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Rogue Dunk\nRogue Dunk\nShare\nDeveloper\nhaluk barkın evgin\nRating\n8.8\n(260 votes)\nReleased\nSeptember 2024\nTechnology\nHTML5 (Unity WebGL)\nPlatform\nBrowser (desktop, mobile, tablet)\n\nSports\n\n151\n\nBall\n\n165\n\nBasketball\n\n34\n\n2D\n\n975\n\nArcade\n\n406\n\nRogue Dunk is a thrilling 2D basketball game that combines fast-paced action with rogue-like strategy. Each game offers new skills to unlock and challenges to face, making every match feel fresh and exciting. Test your skills, adapt your strategy, and push your score higher as you take on this unique blend of sports and adventure.\n\nControls\n\nDrag the left mouse to choose your trajectory and release to shoot."
  },
  {
    "id": 34,
    "name": "basketball-serial-shooter",
    "href": "https://www.crazygames.com/game/basketball-serial-shooter",
    "link": "https://games.crazygames.com/en_US/basketball-serial-shooter/index.html?isNewUser=false&v=1.344",
    "icon": "https://imgs.crazygames.com/games/basketball-serial-shooter/cover-1663858495600.png?metadata=none&quality=85&width=273&fit=crop",
    "detail": "Games»Sports»Basketball»Basketball Serial Shooter\nBasketball Serial Shooter\nShare\nDeveloper\nPlaytouch\nRating\n8.8\n(226 votes)\nReleased\nOctober 2022\nTechnology\nHTML5\nPlatforms\nBrowser (desktop, mobile, tablet), App Store(iOS, Android)\n\nSports\n\n151\n\nOne Button\n\n82\n\nPhysics\n\n351\n\nBasketball\n\n34\n\nMouse\n\n1,644\n\nBasketball Serial Shooter is an arcade basketball game where you must throw the ball into the basket before the time runs out. Try to make as many points as you can on each play. Good luck!\n\nRelease Date\nJanuary 2022 (Android)\nFebruary 2022 (iOS)\nMay 2022 (HTML5)\nDeveloper\n\nBasketball Serial Shooter is made by Playtouch.\n\nPlatforms\nWeb browser (desktop and mobile)\nAndroid\niOS\nControls\n\nUse the left mouse button to throw the ball."
  }
]